AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/MeanVelocityForceCellZone/case/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


#includeIfPresent "fvOptionsScalarTransport"

Cylinder001MomentumSource
{
    type            meanVelocityForce;
    selectionMode   cellZone;
    cellZone        Cylinder001;
    active          yes;
    meanVelocityForceCoeffs
    {
        selectionMode   cellZone;
        cellZone        Cylinder001;
        fields          (U);
        direction       (1.0 0.0 0.0);
        Ubar            (0.04 0.0 0.0);
        relaxation      0.2;
    }
}

Cylinder002MomentumSource
{
    type            meanVelocityForce;
    selectionMode   cellZone;
    cellZone        Cylinder002;
    active          yes;
    meanVelocityForceCoeffs
    {
        selectionMode   cellZone;
        cellZone        Cylinder002;
        fields          (U);
        direction       (0.0 1.0 0.0);
        Ubar            (0.0 0.06 0.0);
        relaxation      0.2;
    }
}

CylinderMomentumSource
{
    type            meanVelocityForce;
    selectionMode   cellZone;
    cellZone        Cylinder;
    active          yes;
    meanVelocityForceCoeffs
    {
        selectionMode   cellZone;
        cellZone        Cylinder;
        fields          (U);
        direction       (0.0 0.0 1.0);
        Ubar            (0.0 0.0 0.08);
        relaxation      0.2;
    }
}

//************************************************************************ //
